/*//法1:用指针数组指向二维数组的每一行的首地址
#include<stdio.h>
int main()
{
    int a[3][3]={{1,2,3},{4,5,6},{7,8,9}};
	int *p[3]={a[0],a[1],a[2]};    //初始化指针，指向每一行的开头
	int i;
	for(i=0;i<3;i++)
		printf("%d %d %d\n",*p[i]+0,*p[i]+1,*p[i]+2);  //*p[i]+1<=>a[i][1],其他一样的道理
	return 0;
}*/



//法2:二维数组指针实例
#include<stdio.h>
int main()
{
	int i;
    int a[3][3]={{1,2,3},{4,5,6},{7,8,9}};
	int (*p)[3];    //定义指针数组
	p=a;    //指针赋值
	for(i=0;i<3;i++)
	   printf("%d %d %d\n",*(p[i]+0),*(p[i]+1),*(p[i]+2));    //*(p[i]+0)<=>a[i][0],其他一样的道理，因为p开始逐一指向，只是地址，所以要用（）扩住并用*取值
	return 0;
}


